# 4. Домашнее задание

# Задача 1
print("\nЗадача 1:")
limit = int(input("Введите число: "))
for i in range(1, limit + 1):
    print(i)

# Задача 2
print("\nЗадача 2:")
num1 = int(input("Введите первое число: "))
num2 = int(input("Введите второе число: "))

if num1 > num2:
    print("Большее число:", num1)
else:
    print("Большее число:", num2)